build/docs/runtime/utils/entitymgrs/volatile/safe/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Utility Safe Volatile Entity Manager</title>
<!-- 2017-04-27 Thu 09:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../../../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../../../style/css/override.css" />
<link rel="icon" type="image/png" href="../../../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../../../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Utility Safe Volatile Entity Manager</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Implementation</a>
<ul>
<li><a href="#sec-1-1">1.1. Imports</a></li>
<li><a href="#sec-1-2">1.2. Initialization</a></li>
<li><a href="#sec-1-3">1.3. Safe add</a></li>
<li><a href="#sec-1-4">1.4. Safe delete</a></li>
<li><a href="#sec-1-5">1.5. Safe update</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Implementation</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Imports</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> copy
<span style="font-weight: bold;">from</span> runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> check
<span style="font-weight: bold;">from</span> runtime.utils.entitymgrs.volatile.unsafe.uvem <span style="font-weight: bold;">import</span> UnsafeVolatileEntityMgr
<span style="font-weight: bold;">from</span>  runtime.utils.entitymgrs.volatile.volatile_entity_mgr_exception <span style="font-weight: bold;">import</span> VolatileEntityMgrException
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Initialization</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">SafeVolatileEntityMgr</span>(UnsafeVolatileEntityMgr):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
       UnsafeVolatileEntityMgr.__init__(<span style="font-weight: bold;">self</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Safe add</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Adds only if <code>entity</code> is not present in the aggregate.
Otherwise, throws an "entity already present" exception.
</p>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">safe_add</span>(<span style="font-weight: bold;">self</span>, entity):
        check(<span style="font-weight: bold;">lambda</span> e: <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">self</span>.is_present(e),
              VolatileEntityMgrException(op=<span style="font-style: italic;">"safe_add"</span>, 
                  msg=<span style="font-style: italic;">"entity %s already present"</span> % entity.to_client()))(entity)

        <span style="font-weight: bold;">self</span>.unsafe_add(entity)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Safe delete</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Deletes  only if <code>entity</code> is  present in the aggregate.
Otherwise, throws an "entity not present" exception.
</p>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">safe_delete</span>(<span style="font-weight: bold;">self</span>, entity):
        check(<span style="font-weight: bold;">self</span>.is_present, 
              VolatileEntityMgrException(op=<span style="font-style: italic;">"safe_delete"</span>, 
                  msg=<span style="font-style: italic;">"entity %s not present"</span> % entity.to_client()))(entity)

        <span style="font-weight: bold;">self</span>.unsafe_delete(entity)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Safe update</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Updates <code>entity</code> with the new mappings specifed in <code>args</code>.
</p>

<ol class="org-ol">
<li><code>entity</code> must be present in the aggregate.
</li>

<li>First a <code>new_entity</code> is built by copying <code>entity</code>.  
</li>

<li>Then <code>new_entity</code> is set with <code>args</code>.   
</li>

<li>If this results in <code>new_entity</code> being equal to
<code>entity</code>, then 

<p>
a)  <code>entity</code> is deleted
b)  <code>new_entity</code> is added
</p>

<p>
Otherwise:
</p>

<p>
c) <code>new_entity</code> is added in a safe manner
d) <code>entity</code> is deleted in an unsafe manner
</p>
</li>
</ol>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">safe_update</span>(<span style="font-weight: bold;">self</span>, entity, **args):
        check(<span style="font-weight: bold;">self</span>.is_present,    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">1</span>
              VolatileEntityMgrException(op=<span style="font-style: italic;">"safe_update"</span>, 
                  msg=<span style="font-style: italic;">"entity %s not present"</span> % entity.to_client()))(entity)

        <span style="font-weight: bold; font-style: italic;">new_entity</span>=copy.copy(entity) <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">2</span>
        new_entity.<span style="font-weight: bold;">set</span>(**args)       <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">3</span>
        <span style="font-weight: bold;">if</span> new_entity == entity:     <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">4</span>
            <span style="font-weight: bold;">self</span>.unsafe_delete(entity)  <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">a</span>
            <span style="font-weight: bold;">self</span>.unsafe_add(new_entity) <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">b</span>
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">self</span>.safe_add(new_entity)   <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">c</span>
            <span style="font-weight: bold;">self</span>.unsafe_delete(entity)  <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">d</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-22 Sat]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 09:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
